_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасчетЦелевыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>УСОERP_РасчетЦелевыхПоказателей</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.УСОERP_ЦелевыеПоказателиПроекта</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПроектПортфельПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УСОERP_ПортфельПроектов</v8:Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сценарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сценарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидБюджета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭкземплярБюджета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроектаНачало</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокПроектаОкончание</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.Периодичность</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказательБюджетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоказателиБюджетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыПланов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУстановкаНефинансовыхПоказателейФакторДисконта</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЗначенийНефинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументУстановкаНефинансовыхПоказателейПриведеннаяСтоимость</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.УстановкаЗначенийНефинансовыхПоказателей</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Показатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументУстановкаЗначенийНефинансовыхПоказателей</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.УстановкаЗначенийНефинансовыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Параметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства</v8:Type>
								<v8:Type>cfg:EnumRef.УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтавкиДисконтирования</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>6</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ПоказателиПоПериодам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Период</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЧистыйДенежныйПоток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФакторДисконта</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриведеннаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>18</v8:Digits>
									<v8:FractionDigits>5</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Enums/УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НачальныеИнвестиции</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СреднегодоваяПрибыль</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СуммаИнвестиций</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОстаточнаяСтоимостьАктивов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НачальнаяСтавкаДисконтирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаксимальнаяСтавкаДисконтирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ШагДляСтавкиДисконтирования</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/Rarus/USO2/Documents/УСОERP_РасчетЦелевыхПоказателей/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда // Возврат при получении формы для анализа.
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
	СобытияФорм.ПриСозданииНаСервере(ЭтотОбъект, Отказ, СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	СформироватьТаблицуПоказателиПоПериодам();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

&НаСервере
Процедура СформироватьТаБлицуПоказателиПоПериодамНаСервере()
	ПоказателиПоПериодам.Очистить();
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.УСОERP_РасчетЦелевыхПоказателей.Макет_ПоказателиПоПериодам");
	ОбластьМакета = Макет.ПолучитьОбласть("Показатели");
	
	ПоказателиПоПериодам.Вывести(ОбластьМакета);
	
	Если Объект.ПоказателиПоПериодам.Количество()> 0 Тогда
		ОбластьМакета = Макет.ПолучитьОбласть("ЗначениеПоказателей");
		Для Каждого стр из Объект.ПоказателиПоПериодам Цикл
			ОбластьМакета.Параметры.Период 		= Формат(стр.Период,"ДЛФ=Д");
			ОбластьМакета.Параметры.ЗначениеЧДП = стр.ЧистыйДенежныйПоток;
			ОбластьМакета.Параметры.ЗначениеФД	= стр.ФакторДисконта;
			ОбластьМакета.Параметры.ЗначениеПС	= стр.ПриведеннаяСтоимость;
			ПоказателиПоПериодам.Присоединить(ОбластьМакета);
		КонецЦикла;	
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьТаблицуПоказателиПоПериодам()
	
	СформироватьТаблицуПоказателиПоПериодамНаСервере();
	ЭтаФорма.ПоказателиПоПериодам.ФиксацияСлева = 1;
	//ЭтаФорма.ПоказателиПоПериодам.Показать();
	
КонецПроцедуры	

&НаСервере
Процедура ЗаполнитьПоказателиНаСервере()
	
	//Обновим таблицу показатели
	Объект.Показатели.Очистить();
	
	стр = Объект.Показатели.Добавить();
	стр.Показатель = Справочники.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.ЧистаяПриведеннаяСтоимость;
	
	стр = Объект.Показатели.Добавить();
	стр.Показатель = Справочники.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.Окупаемость;
	
	стр = Объект.Показатели.Добавить();
	стр.Показатель = Справочники.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.ДисконтированнаяОкупаемость;
	
	стр = Объект.Показатели.Добавить();
	стр.Показатель = Справочники.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.ВнутренняяНормаРентабельности;
	
	стр = Объект.Показатели.Добавить();
	стр.Показатель = Справочники.УСОERP_ЦелевыеПоказателиИПараметрыОбъектаСтроительства.БухгалтерскаяНормаПрибыли;
	
	//Обновим таблицу Параметры
	Объект.Параметры.Очистить();
	
	стр = Объект.Параметры.Добавить();
	стр.Показатель = Перечисления.УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей.НачальныеИнвестиции;
	
	стр = Объект.Параметры.Добавить();
	стр.Показатель = Перечисления.УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей.НачальнаяСтавкаДисконтирования;
	
	стр = Объект.Параметры.Добавить();
	стр.Показатель = Перечисления.УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей.ШагДляСтавкиДисконтирования;
	
	стр = Объект.Параметры.Добавить();
	стр.Показатель = Перечисления.УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей.МаксимальнаяСтавкаДисконтирования;
	
	стр = Объект.Параметры.Добавить();
	стр.Показатель = Перечисления.УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей.СуммаИнвестиций;
	
	стр = Объект.Параметры.Добавить();
	стр.Показатель = Перечисления.УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей.СреднегодоваяПрибыль;
	
	стр = Объект.Параметры.Добавить();
	стр.Показатель = Перечисления.УСОERP_ПараметрыДляРасчетаЦелевыхПоказателей.ОстаточнаяСтоимостьАктивов;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказатели(Команда)	
	
	ПоказатьВопрос(Новый ОписаниеОповещения("ЗаполнитьПоказателиПродолжение",ЭтотОбъект),"Списки показателей и параметров будут очищены. Продолжить?!", РежимДиалогаВопрос.ДаНет);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоказателиПродолжение(Ответ,ДопПараметры) Экспорт
	
	Если Ответ = КодВозвратаДиалога.Да Тогда
		ЗаполнитьПоказателиНаСервере();
	КонецЕсли;	
	
КонецПроцедуры  
&НаСервере
Процедура РассчитатьПоказателиНаСервере()
	
	УСОERP_ЗащищенныеФункцииСервер.УСОERP_РасчетЦелевыхПоказателей_РассчитатьПоказателиНаСервере(ЭтотОбъект, Неопределено);
	
КонецПроцедуры

&НаСервере
Процедура УстановитьОтветственногоНаСервере()
	Объект.Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры	

&НаКлиенте
Процедура РассчитатьПоказатели(Команда)
	РассчитатьПоказателиНаСервере();
	СформироватьТаблицуПоказателиПоПериодам();
	УстановитьОтветственногоНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ВидБюджетаПриИзменении(Элемент)
	ВидБюджетаПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВидБюджетаПриИзмененииНаСервере()
	Объект.СрокПроектаНачало	= Объект.ВидБюджета.НачалоПериода;
	Объект.СрокПроектаОкончание	= Объект.ВидБюджета.ОкончаниеПериода;
	Объект.Периодичность		= Объект.ВидБюджета.ВидБюджета.Периодичность;
КонецПроцедуры

&НаКлиенте
Процедура СтавкиДисконтированияДатаНачалаПриИзменении(Элемент)
	
	Если НЕ ЗначениеЗаполнено(ТекущийЭлемент.ТекущиеДанные.ДатаНачала) 
		ИЛИ ТекущийЭлемент.ТекущиеДанные.ДатаНачала < Объект.СрокПроектаНачало Тогда
		ТекущийЭлемент.ТекущиеДанные.ДатаНачала = Объект.СрокПроектаНачало;
	ИначеЕсли ТекущийЭлемент.ТекущиеДанные.ДатаНачала > Объект.СрокПроектаОкончание Тогда 	
		ТекущийЭлемент.ТекущиеДанные.ДатаНачала = Объект.СрокПроектаОкончание;
	КонецЕсли;	
	
КонецПроцедуры


&НаКлиенте
Процедура СтавкиДисконтированияЗначениеПриИзменении(Элемент)
	Если ТекущийЭлемент.ТекущиеДанные.Значение > 1 Тогда
		ТекущийЭлемент.ТекущиеДанные.Значение = 1;
	КонецЕсли;	
	
	Если НЕ ЗначениеЗаполнено(ТекущийЭлемент.ТекущиеДанные.ДатаНачала) 
		ИЛИ ТекущийЭлемент.ТекущиеДанные.ДатаНачала < Объект.СрокПроектаНачало Тогда
		ТекущийЭлемент.ТекущиеДанные.ДатаНачала = Объект.СрокПроектаНачало;
	ИначеЕсли ТекущийЭлемент.ТекущиеДанные.ДатаНачала > Объект.СрокПроектаОкончание Тогда 	
		ТекущийЭлемент.ТекущиеДанные.ДатаНачала = Объект.СрокПроектаОкончание;
	КонецЕсли;	
	
КонецПроцедуры

#КонецОбласти
